---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FabricationRoutingSolutionsUiParam
source: html/eb6d4614-b9f9-526f-108f-4174a25fa6a2.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FabricationRoutingSolutionsUiParam Property

"x of XX"

## Syntax (C#)
```csharp
public static ForgeTypeId FabricationRoutingSolutionsUiParam { get; }
```